import { useThemeContext } from "@lib/useTheme";
import { Card, List, Stack, Title } from "@mantine/core";
import React, { useEffect } from "react";

export default function PrivacyPolicy() {
  const { setTheme } = useThemeContext();

  useEffect(() => {
    const localData = localStorage.getItem("themes");
    if (localData == null) {
      localStorage.setItem("themes", "red");
      setTheme("red");
    }
    setTheme(localData);
  }, [setTheme]);

  return (
    <Card className="bg-foreground text-title">
      <Stack spacing="xs">
        <Title order={2} mb="xs" align="center">
          นโยบายเกี่ยวกับข้อมูลส่วนบุคคล
        </Title>
        <List
          type="ordered"
          withPadding
          className="list-decimal list-outside"
          spacing="lg"
        >
          <List.Item>
            MyAnimeCommunity
            ได้กำหนดนโยบายเกี่ยวกับข้อมูลส่วนบุคคลเพื่อยกระดับมาตรฐานการรักษาความปลอดภัยของข้อมูลส่วนบุคคลของผู้เข้าเยี่ยมชมและใช้บริการเว็บไซต์ให้ดียิ่งขึ้น
            โดยนโยบายนี้กำหนดขึ้นเพื่อให้สอดคล้องกับพระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล
            พ.ศ. 2562
            เพื่อช่วยให้ผู้เข้าเยี่ยมชมเว็บไซต์หรือใช้บริการได้ทราบถึงแนวทางปฏิบัติเกี่ยวกับนโยบายความเป็นส่วนตัว
            และทราบถึงทางเลือกเกี่ยวกับความเป็นส่วนตัวเมื่อเข้าใช้เว็บไซต์
          </List.Item>
          <List.Item>
            วัตถุประสงค์ของการจัดเก็บข้อมูลส่วนบุคคล MyAnimeCommunity
            เก็บรักษาข้อมูลส่วนบุคคลตามวัตถุประสงค์ของกฎหมาย
            และวัตถุประสงค์ในการดำเนินธุรกิจ
            เพื่อวิเคราะห์พฤติกรรมการใช้งานของผู้เข้าใช้
            เพื่อทำให้เข้าใจพฤติกรรมและตอบสนองความต้องการของผู้เข้าเยี่ยมชมเว็บไซต์หรือใช้บริการ
            เพื่อปรับแต่งตัวเลือกฟังก์ชั่นการใช้งาน
          </List.Item>
          <List.Item>
            MyAnimeCommunity มีการคุ้มครองข้อมูลส่วนบุคคลอย่างไร
            MyAnimeCommunity
            มีมาตรการคุ้มครองความปลอดภัยของข้อมูลส่วนบุคคลของผู้ใช้บริการจากการเข้าถึงข้อมูลโดยไม่ได้รับอนุญาต
            การสูญหาย การใช้ข้อมูลในทางที่ผิดไปจากวัตถุประสงค์ในการจัดเก็บ
            การเปิดเผยและการเปลี่ยนแปลงแก้ไข เช่น
            การควบคุมและการอนุญาตให้เข้าถึงข้อมูล
            รวมถึงตรวจสอบว่าข้อมูลที่มีอยู่ถูกต้องและเป็นปัจจุบัน
            แต่ไม่รวมถึงข้อมูลที่ MyAnimeCommunity
            ได้รับอนุญาตจากผู้ใช้บริการให้เปิดเผยแก่บุคคลภายนอกตามที่มีการเชื่อมต่อบัญชี
          </List.Item>
          <List.Item>
            ข้อมูลส่วนบุคคลที่ MyAnimeCommunity จัดเก็บมีดังนี้
          </List.Item>
          <List
            type="ordered"
            withPadding
            className="list-decimal list-outside"
            spacing="lg"
          >
            <List.Item mt="sm">
              ข้อมูลเกี่ยวกับการใช้บริการทั่วไป เช่น cookies,
              ข้อมูลจราจรทางคอมพิวเตอร์
              ซึ่งจัดเก็บเพื่อวิเคราะห์พฤติกรรมการใช้งาน
              เพื่อตอบสนองความต้องการเฉพาะบุคคลของผู้เข้าเยี่ยมชมหรือบริการเว็บไซต์
              และอำนวยความสะดวกแก่ผู้ใช้งานเฉพาะบุคคลในการแสดงผลซึ่งผู้ใช้งานอาจมีความสนใจเป็นพิเศษ
              รวมถึงรักษาบรรยากาศการใช้งานโดยรวม
            </List.Item>
            <List.Item>
              ข้อมูลที่ผู้เข้าใช้บริการได้ลงทะเบียนสมัครสมาชิก เช่น ชื่อสมาชิก
              (ชื่อ login), email, หมายเลขโทรศัพท์,
              วันที่สมัครเข้าเป็นสมาชิกหรือเปลี่ยนแปลงแก้ไขข้อมูลสมาชิก
              โดยจัดเก็บเพื่อวัตถุประสงค์ในการยืนยันตัวบุคคลและป้องกันการปลอมแปลงตัวตน
              แต่ไม่รวมถึงข้อมูลเกี่ยวกับบัตรประชาชนที่ผู้สมัครสมาชิกได้ใช้ในการสมัครเข้าเป็นสมาชิก,
              และไม่รวมถึงข้อมูลเกี่ยวกับตัวผู้ใช้บริการ Facebook หรือ Google
              ยกเว้น แต่ email ที่ใช้ในการเชื่อมต่อบัญชี
            </List.Item>
            <List.Item>
              ข้อมูลของผู้แจ้งลบกระทู้ เช่น ข้อมูลจราจรทางคอมพิวเตอร์, email,
              หมายเลขโทรศัพท์, วันและเวลาที่แจ้งลบ
              จัดเก็บเพื่อจัดทำรายงานการแจ้งลบ
            </List.Item>
            <List.Item>
              ข้อมูลจราจรทางคอมพิวเตอร์จัดเก็บตามข้อบังคับประกาศกระทรวงเทคโนโลยีสารสนเทศ
              และการสื่อสาร
            </List.Item>
            <List.Item>
              ข้อมูลเกี่ยวกับการเข้าใช้บริการ เช่น ข้อมูลการตั้งและตอบกระทู้,
              การร่างกระทู้ (draft), link, รูปภาพในคลังภาพของ login, gifs,
              videos, ข้อมูลการปรับแต่ง tag, ติดตามหรือบล็อก tag,
              การแสดงความรู้สึก, กดให้คะแนน, ข้อมูลเกี่ยวกับอุปกรณ์การใช้งาน,
              ช่องทางการใช้งาน, ตำแหน่งของการเข้าใช้งาน, log files
              โดยจัดเก็บเพื่อรักษาบรรยากาศการใช้งานและวิเคราะห์พฤติกรรมการใช้งาน
            </List.Item>
            <List.Item>
              ข้อมูลส่วนบุคคลที่เก็บเพื่อร่วมกิจกรรมกับทาง MyAnimeCommunity เช่น
              ชื่อนามสกุล, ที่อยู่, หมายเลขโทรศัพท์, email
              จะถูกเก็บเพื่อใช้ในการติดต่อสมาชิกผู้เข้าร่วมกิจกรรม
            </List.Item>
          </List>
          <List.Item>
            ระยะเวลาในการเก็บรวมรวบข้อมูลส่วนบุคคล MyAnimeCommunity
            ดำเนินการจัดเก็บข้อมูลส่วนบุคคลตามหลักเกณฑ์ของพระราชบัญญัติว่าด้วยการกระทำความผิดเกี่ยวกับคอมพิวเตอร์
            พ.ศ. 2550
            โดยสำหรับข้อมูลเกี่ยวกับผู้เข้าใช้บริการซึ่งได้ลงทะเบียนสมัครสมาชิกจะถูกจัดเก็บไว้ตลอดระยะเวลาการเข้าใช้บริการ
          </List.Item>
          <List.Item>
            การแลกเปลี่ยนข้อมูล MyAnimeCommunity
            ไม่มีนโยบายเปิดเผยข้อมูลส่วนบุคคลของผู้เข้าใช้บริการในลักษณะเจาะจงเป็นรายบุคคลแก่บุคคลภายนอก
            เว้นแต่จะต้องปฏิบัติตามข้อกำหนดของกฎหมาย
          </List.Item>
        </List>
      </Stack>
    </Card>
  );
}
